; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v2 ?v13)
             (pred_11 ?v10 ?v3)
             (pred_7 ?v2 ?v3)
             (pred_2 ?v5 ?v2 )
	     (pred_10 ?v2)
             (pred_9 ?v8)
             (pred_12 ?v10)
             (pred_8 ?v3)
             (pred_4 ?v2)
             (pred_6 ?v10)
             (pred_3 ?v2)
             (pred_1 ))



(:action op_2
:parameters (?v9 ?v12 ?v1 ?v7)
:precondition (and (pred_9 ?v9) (pred_9 ?v12) (pred_12 ?v1) (pred_8 ?v7)
          (pred_5 ?v9 ?v12) (pred_11 ?v1 ?v7)
                   (pred_7 ?v12 ?v7) (pred_10 ?v9) 
                   (pred_4 ?v12) (pred_6 ?v1))
:effect (and  (pred_3 ?v12) (not (pred_4 ?v12))))


(:action op_5
:parameters (?v9 ?v6)
:precondition (and (pred_9 ?v9) (pred_9 ?v6)
               (pred_10 ?v9) (pred_5 ?v9 ?v6) (pred_3 ?v6))
:effect (and (pred_10 ?v6) (not (pred_10 ?v9))))

(:action op_1
:parameters (?v9 ?v1)
:precondition (and (pred_9 ?v9) (pred_12 ?v1) 
                  (pred_10 ?v9) (pred_2 ?v1 ?v9) (pred_1 ))
:effect (and (pred_6 ?v1)
   (not (pred_2 ?v1 ?v9)) (not (pred_1 ))))


(:action op_3
:parameters (?v9 ?v11 ?v4)
:precondition (and (pred_9 ?v9) (pred_12 ?v11) (pred_12 ?v4)
                  (pred_10 ?v9) (pred_6 ?v4) (pred_2 ?v11 ?v9))
:effect (and (pred_6 ?v11) (pred_2 ?v4 ?v9)
        (not (pred_6 ?v4)) (not (pred_2 ?v11 ?v9))))

(:action op_4
:parameters (?v9 ?v1)
:precondition (and (pred_9 ?v9) (pred_12 ?v1) 
                  (pred_10 ?v9) (pred_6 ?v1))
:effect (and (pred_1 ) (pred_2 ?v1 ?v9) (not (pred_6 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_24 obj_20 obj_06 obj_15 obj_22 obj_04 obj_12 obj_05 obj_16 obj_08 obj_10 obj_29 obj_19 obj_11 obj_17 obj_02 obj_01 obj_28 obj_07 obj_14 obj_30 obj_09 obj_23 obj_21
    obj_25 obj_27
    obj_26 obj_13 obj_18
    )

    (:init
       (pred_1)

       (pred_9 obj_03)
       (pred_9 obj_24)
       (pred_9 obj_20)
       (pred_9 obj_06)
       (pred_9 obj_15)
       (pred_9 obj_22)
       (pred_9 obj_04)
       (pred_9 obj_12)
       (pred_9 obj_05)
       (pred_9 obj_16)
       (pred_9 obj_08)
       (pred_9 obj_10)
       (pred_9 obj_29)
       (pred_9 obj_19)
       (pred_9 obj_11)
       (pred_9 obj_17)
       (pred_9 obj_02)
       (pred_9 obj_01)
       (pred_9 obj_28)
       (pred_9 obj_07)
       (pred_9 obj_14)
       (pred_9 obj_30)
       (pred_9 obj_09)
       (pred_9 obj_23)
       (pred_9 obj_21)
       (pred_8 obj_25)
       (pred_8 obj_27)
       (pred_12 obj_26)
       (pred_12 obj_13)
       (pred_12 obj_18)

       (pred_5 obj_03 obj_22)
       (pred_5 obj_03 obj_24)
       (pred_5 obj_24 obj_04)
       (pred_5 obj_24 obj_20)
       (pred_5 obj_24 obj_03)
       (pred_5 obj_20 obj_12)
       (pred_5 obj_20 obj_06)
       (pred_5 obj_20 obj_24)
       (pred_5 obj_06 obj_05)
       (pred_5 obj_06 obj_15)
       (pred_5 obj_06 obj_20)
       (pred_5 obj_15 obj_16)
       (pred_5 obj_15 obj_06)
       (pred_5 obj_22 obj_08)
       (pred_5 obj_22 obj_04)
       (pred_5 obj_22 obj_03)
       (pred_5 obj_04 obj_10)
       (pred_5 obj_04 obj_12)
       (pred_5 obj_04 obj_24)
       (pred_5 obj_04 obj_22)
       (pred_5 obj_12 obj_29)
       (pred_5 obj_12 obj_05)
       (pred_5 obj_12 obj_20)
       (pred_5 obj_12 obj_04)
       (pred_5 obj_05 obj_19)
       (pred_5 obj_05 obj_16)
       (pred_5 obj_05 obj_06)
       (pred_5 obj_05 obj_12)
       (pred_5 obj_16 obj_11)
       (pred_5 obj_16 obj_15)
       (pred_5 obj_16 obj_05)
       (pred_5 obj_08 obj_17)
       (pred_5 obj_08 obj_10)
       (pred_5 obj_08 obj_22)
       (pred_5 obj_10 obj_02)
       (pred_5 obj_10 obj_29)
       (pred_5 obj_10 obj_04)
       (pred_5 obj_10 obj_08)
       (pred_5 obj_29 obj_01)
       (pred_5 obj_29 obj_19)
       (pred_5 obj_29 obj_12)
       (pred_5 obj_29 obj_10)
       (pred_5 obj_19 obj_28)
       (pred_5 obj_19 obj_11)
       (pred_5 obj_19 obj_05)
       (pred_5 obj_19 obj_29)
       (pred_5 obj_11 obj_07)
       (pred_5 obj_11 obj_16)
       (pred_5 obj_11 obj_19)
       (pred_5 obj_17 obj_14)
       (pred_5 obj_17 obj_02)
       (pred_5 obj_17 obj_08)
       (pred_5 obj_02 obj_30)
       (pred_5 obj_02 obj_01)
       (pred_5 obj_02 obj_10)
       (pred_5 obj_02 obj_17)
       (pred_5 obj_01 obj_09)
       (pred_5 obj_01 obj_28)
       (pred_5 obj_01 obj_29)
       (pred_5 obj_01 obj_02)
       (pred_5 obj_28 obj_23)
       (pred_5 obj_28 obj_07)
       (pred_5 obj_28 obj_19)
       (pred_5 obj_28 obj_01)
       (pred_5 obj_07 obj_21)
       (pred_5 obj_07 obj_11)
       (pred_5 obj_07 obj_28)
       (pred_5 obj_14 obj_30)
       (pred_5 obj_14 obj_17)
       (pred_5 obj_30 obj_09)
       (pred_5 obj_30 obj_02)
       (pred_5 obj_30 obj_14)
       (pred_5 obj_09 obj_23)
       (pred_5 obj_09 obj_01)
       (pred_5 obj_09 obj_30)
       (pred_5 obj_23 obj_21)
       (pred_5 obj_23 obj_28)
       (pred_5 obj_23 obj_09)
       (pred_5 obj_21 obj_07)
       (pred_5 obj_21 obj_23)
       (pred_4 obj_28)
       (pred_4 obj_20)
       (pred_4 obj_15)
       (pred_7  obj_28 obj_25)
       (pred_7  obj_20 obj_27)
       (pred_7  obj_15 obj_27)
       (pred_3 obj_03)
       (pred_3 obj_24)
       (pred_3 obj_06)
       (pred_3 obj_22)
       (pred_3 obj_04)
       (pred_3 obj_12)
       (pred_3 obj_05)
       (pred_3 obj_16)
       (pred_3 obj_08)
       (pred_3 obj_10)
       (pred_3 obj_29)
       (pred_3 obj_19)
       (pred_3 obj_11)
       (pred_3 obj_17)
       (pred_3 obj_02)
       (pred_3 obj_01)
       (pred_3 obj_07)
       (pred_3 obj_14)
       (pred_3 obj_30)
       (pred_3 obj_09)
       (pred_3 obj_23)
       (pred_3 obj_21)

       (pred_11  obj_26 obj_25)
       (pred_11  obj_13 obj_27)
       (pred_11  obj_18 obj_27)
       (pred_2 obj_26 obj_06)
       (pred_2 obj_13 obj_19)
       (pred_2 obj_18 obj_14)
       (pred_10 obj_21)
    )

    (:goal (and
       (pred_2 obj_13 obj_23)
       (pred_2 obj_18 obj_05)
    ))
(:constraints
  (always (not (pred_10 obj_09)))
)
)

; plan
1. (op_5 obj_21 obj_07)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_07)
   goals met: 0 of 2
2. (op_5 obj_07 obj_11)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_11)
   goals met: 0 of 2
3. (op_5 obj_11 obj_19)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_19)
   goals met: 0 of 2
4. (op_1 obj_19 obj_13)
   deleted: (pred_2 obj_13 obj_19) (pred_1)
   added: (pred_6 obj_13)
   goals met: 0 of 2
5. (op_5 obj_19 obj_29)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_29)
   goals met: 0 of 2
6. (op_5 obj_29 obj_01)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_01)
   goals met: 0 of 2
7. (op_5 obj_01 obj_02)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_02)
   goals met: 0 of 2
8. (op_5 obj_02 obj_30)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_30)
   goals met: 0 of 2
9. (op_4 obj_30 obj_13)
   deleted: (pred_6 obj_13)
   added: (pred_1) (pred_2 obj_13 obj_30)
   goals met: 0 of 2
10. (op_5 obj_30 obj_14)
   deleted: (pred_10 obj_30)
   added: (pred_10 obj_14)
   goals met: 0 of 2
11. (op_1 obj_14 obj_18)
   deleted: (pred_2 obj_18 obj_14) (pred_1)
   added: (pred_6 obj_18)
   goals met: 0 of 2
12. (op_5 obj_14 obj_30)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_30)
   goals met: 0 of 2
13. (op_5 obj_30 obj_02)
   deleted: (pred_10 obj_30)
   added: (pred_10 obj_02)
   goals met: 0 of 2
14. (op_4 obj_02 obj_18)
   deleted: (pred_6 obj_18)
   added: (pred_1) (pred_2 obj_18 obj_02)
   goals met: 0 of 2
15. (op_5 obj_02 obj_30)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_30)
   goals met: 0 of 2
16. (op_1 obj_30 obj_13)
   deleted: (pred_2 obj_13 obj_30) (pred_1)
   added: (pred_6 obj_13)
   goals met: 0 of 2
17. (op_5 obj_30 obj_02)
   deleted: (pred_10 obj_30)
   added: (pred_10 obj_02)
   goals met: 0 of 2
18. (op_5 obj_02 obj_01)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_01)
   goals met: 0 of 2
19. (op_4 obj_01 obj_13)
   deleted: (pred_6 obj_13)
   added: (pred_1) (pred_2 obj_13 obj_01)
   goals met: 0 of 2
20. (op_5 obj_01 obj_02)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_02)
   goals met: 0 of 2
21. (op_1 obj_02 obj_18)
   deleted: (pred_2 obj_18 obj_02) (pred_1)
   added: (pred_6 obj_18)
   goals met: 0 of 2
22. (op_5 obj_02 obj_01)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_01)
   goals met: 0 of 2
23. (op_5 obj_01 obj_29)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_29)
   goals met: 0 of 2
24. (op_5 obj_29 obj_19)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_19)
   goals met: 0 of 2
25. (op_4 obj_19 obj_18)
   deleted: (pred_6 obj_18)
   added: (pred_1) (pred_2 obj_18 obj_19)
   goals met: 0 of 2
26. (op_5 obj_19 obj_29)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_29)
   goals met: 0 of 2
27. (op_5 obj_29 obj_01)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_01)
   goals met: 0 of 2
28. (op_1 obj_01 obj_13)
   deleted: (pred_2 obj_13 obj_01) (pred_1)
   added: (pred_6 obj_13)
   goals met: 0 of 2
29. (op_5 obj_01 obj_29)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_29)
   goals met: 0 of 2
30. (op_5 obj_29 obj_19)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_19)
   goals met: 0 of 2
31. (op_3 obj_19 obj_18 obj_13)
   deleted: (pred_6 obj_13) (pred_2 obj_18 obj_19)
   added: (pred_6 obj_18) (pred_2 obj_13 obj_19)
   goals met: 0 of 2
32. (op_5 obj_19 obj_05)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_05)
   goals met: 0 of 2
33. (op_4 obj_05 obj_18)
   deleted: (pred_6 obj_18)
   added: (pred_1) (pred_2 obj_18 obj_05)
   goals met: 1 of 2
34. (op_5 obj_05 obj_19)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_19)
   goals met: 1 of 2
35. (op_1 obj_19 obj_13)
   deleted: (pred_2 obj_13 obj_19) (pred_1)
   added: (pred_6 obj_13)
   goals met: 1 of 2
36. (op_5 obj_19 obj_11)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_11)
   goals met: 1 of 2
37. (op_5 obj_11 obj_07)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_07)
   goals met: 1 of 2
38. (op_5 obj_07 obj_21)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_21)
   goals met: 1 of 2
39. (op_5 obj_21 obj_23)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_23)
   goals met: 1 of 2
40. (op_4 obj_23 obj_13)
   deleted: (pred_6 obj_13)
   added: (pred_1) (pred_2 obj_13 obj_23)
   goals met: 2 of 2
